Revit 2024 API
PointLoad.IsPointInsideHostBoundaries Method
 Indicates if the point is inside panel's boundaries or if the point is on the member's curve..
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static bool IsPointInsideHostBoundaries(
	Document pDoc,
	ElementId hostId,
	XYZ point
)
Visual Basic
Public Shared Function IsPointInsideHostBoundaries ( _
	pDoc As Document, _
	hostId As ElementId, _
	point As XYZ _
) As Boolean
Visual C++
public:
static bool IsPointInsideHostBoundaries(
	Document^ pDoc,
	ElementId^ hostId,
	XYZ^ point
)
Parameters
pDoc
Type: Autodesk.Revit.DB.Document
 The document containing both the host and the load.
hostId
Type: Autodesk.Revit.DB.ElementId
 The id of the analytical element that is about to host a point load.
point
Type: Autodesk.Revit.DB.XYZ
 The position of point load, measured in decimal feet.
Return Value
 True if a point load can be placed on the input host id
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PointLoad Class
Autodesk.Revit.DB.Structure Namespace